/*******************************************************************
***  File Name : card.js
***  Version : V1.0
***  Designer : 幸前　譲
***  Date : 2023.06.13
***  Purpose        : カードを表すクラスを定義する
***　Module    : 5 カード処理
*******************************************************************/
/*
*** Revision :
*** V1.0 : 幸前　譲, 2023.06.13
*/


export default class Card {
  #rank; //　カードのランク(数字)　2~14(J, Q, K, Aは11~14)
  #suit; // 絵柄(1:クローバー, 2:ダイヤ, 3:ハート, 4:スペード) 数字が大きいものほど強い
  #index; // カードのインデックス番号(0~51)

  get rank() {
    return this.#rank;
  }
  set rank(rank) {
    this.#rank = rank;
  }

  get suit() {
    return this.#suit;
  }
  set suit(suit) {
    this.#suit = suit;
  }

  get index() {
    return this.#index;
  }
  set index(index) {
    this.#index = index;
  }

  /*
  3つのプロパティに値を設定する
  「rankとsuit」と「index」は相互変換可能

  カードのindex
  Card     |  A |  2 |  3 |  4 |  5 |  6 |  7 |  8 |  9 | 10 |  J |  Q |  K |
  ---------------------------------------------------------------------------
  Clover   |  1 |  2 |  3 |  4 |  5 |  6 |  7 |  8 |  9 | 10 | 11 | 12 | 13 |
  Diamond  | 14 | 15 | 16 | 17 | 18 | 19 | 20 | 21 | 22 | 23 | 24 | 25 | 26 |
  Heart    | 27 | 28 | 29 | 30 | 31 | 32 | 33 | 34 | 35 | 36 | 37 | 38 | 39 |
  Spade    | 40 | 41 | 42 | 43 | 44 | 45 | 46 | 47 | 48 | 49 | 50 | 51 | 52 |

  カードのrank ((index - 1) % 13 + 1 ただし, Aは14)
  Card     |  A |  2 |  3 |  4 |  5 |  6 |  7 |  8 |  9 | 10 |  J |  Q |  K |
  ---------------------------------------------------------------------------
  Clover   | 14 |  2 |  3 |  4 |  5 |  6 |  7 |  8 |  9 | 10 | 11 | 12 | 13 |
  Diamond  | 14 |  2 |  3 |  4 |  5 |  6 |  7 |  8 |  9 | 10 | 11 | 12 | 13 | 
  Heart    | 14 |  2 |  3 |  4 |  5 |  6 |  7 |  8 |  9 | 10 | 11 | 12 | 13 | 
  Spade    | 14 |  2 |  3 |  4 |  5 |  6 |  7 |  8 |  9 | 10 | 11 | 12 | 13 | 

  カードのsuit (Math.floor((index - 1) / 13) + 1)
  Card     |  A |  2 |  3 |  4 |  5 |  6 |  7 |  8 |  9 | 10 |  J |  Q |  K |
  ---------------------------------------------------------------------------
  Clover   |  1 |  1 |  1 |  1 |  1 |  1 |  1 |  1 |  1 |  1 |  1 |  1 |  1 |
  Diamond  |  2 |  2 |  2 |  2 |  2 |  2 |  2 |  2 |  2 |  2 |  2 |  2 |  2 |
  Heart    |  3 |  3 |  3 |  3 |  3 |  3 |  3 |  3 |  3 |  3 |  3 |  3 |  3 |
  Spade    |  4 |  4 |  4 |  4 |  4 |  4 |  4 |  4 |  4 |  4 |  4 |  4 |  4 | 
  */
  constructor(index) {
    this.rank = ((index - 1) % 13) + 1;
    // Aのランクは14として扱う
    if (this.rank == 1) {
      this.rank = 14;
    }
    this.suit = Math.floor((index - 1) / 13) + 1;
    this.index = index;
  }
}